In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.222679 -1.093072 -0.543234
1 -0.743648  0.978458 -2.124436
2  2.260599 -1.208209  0.167281
3 -0.905319 -0.483602  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [16]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0  1.222679       NaN -0.543234
1 -0.743648       NaN -2.124436
2  2.260599       NaN  0.167281
3 -0.905319       NaN  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [17]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.222679       NaN       NaN
1 -0.743648       NaN       NaN
2  2.260599       NaN  0.167281
3 -0.905319       NaN  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [18]:
df.dropna()

          0         1         2
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [19]:
df.dropna(thresh=2)

          0         1         2
2  2.260599       NaN  0.167281
3 -0.905319       NaN  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [20]:
df.fillna(0)

          0         1         2
0  1.222679  0.000000  0.000000
1 -0.743648  0.000000  0.000000
2  2.260599  0.000000  0.167281
3 -0.905319  0.000000  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [21]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.222679  0.500000  0.000000
1 -0.743648  0.500000  0.000000
2  2.260599  0.500000  0.167281
3 -0.905319  0.500000  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [22]:
_ = df.fillna(0, inplace = True)
df

          0         1         2
0  1.222679  0.000000  0.000000
1 -0.743648  0.000000  0.000000
2  2.260599  0.000000  0.167281
3 -0.905319  0.000000  0.178749
4  1.212627 -1.429066 -0.074659
5 -1.277668  1.814112 -0.001596
6  0.560066 -0.457621 -0.632403

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  1.093162 -0.085608  0.358331
1  1.880695  0.367911 -1.470363
2 -0.434774  0.669462  1.578154
3  1.027103  1.789619  0.717241
4 -0.596542  0.496739 -1.062629
5 -0.699787  0.013252 -2.176486

In [24]:
df.iloc[2:, 1] = np.nan
df

          0         1         2
0  1.093162 -0.085608  0.358331
1  1.880695  0.367911 -1.470363
2 -0.434774       NaN  1.578154
3  1.027103       NaN  0.717241
4 -0.596542       NaN -1.062629
5 -0.699787       NaN -2.176486

In [25]:
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  1.093162 -0.085608  0.358331
1  1.880695  0.367911 -1.470363
2 -0.434774       NaN  1.578154
3  1.027103       NaN  0.717241
4 -0.596542       NaN       NaN
5 -0.699787       NaN       NaN

In [26]:
df.fillna(method="ffill")

          0         1         2
0  1.093162 -0.085608  0.358331
1  1.880695  0.367911 -1.470363
2 -0.434774  0.367911  1.578154
3  1.027103  0.367911  0.717241
4 -0.596542  0.367911  0.717241
5 -0.699787  0.367911  0.717241

In [27]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  1.093162 -0.085608  0.358331
1  1.880695  0.367911 -1.470363
2 -0.434774  0.367911  1.578154
3  1.027103  0.367911  0.717241
4 -0.596542       NaN  0.717241
5 -0.699787       NaN  0.717241

In [28]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [29]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [30]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "Pastrami", "corned beef", "Bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [38]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [39]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [48]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [50]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data.rename(index={"OHIO": "INDIANA"}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [52]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [54]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [55]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [56]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [57]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [58]:
data = np.random.randn(20)
pd.cut(data, 4, precision=2)

[(0.54, 1.36], (-0.28, 0.54], (0.54, 1.36], (-0.28, 0.54], (0.54, 1.36], ..., (0.54, 1.36], (-0.28, 0.54], (-0.28, 0.54], (0.54, 1.36], (-1.1, -0.28]]
Length: 20
Categories (4, interval[float64, right]): [(-1.92, -1.1] < (-1.1, -0.28] < (-0.28, 0.54] < (0.54, 1.36]]

In [59]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.759, -0.0402], (-0.0402, 0.711], (-0.759, -0.0402], (-0.0402, 0.711], (-0.759, -0.0402], ..., (-0.759, -0.0402], (0.711, 3.173], (-0.0402, 0.711], (-3.026, -0.759], (-0.0402, 0.711]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.026, -0.759] < (-0.759, -0.0402] < (-0.0402, 0.711] < (0.711, 3.173]]

In [60]:
pd.value_counts(cats)

(-3.026, -0.759]     250
(-0.759, -0.0402]    250
(-0.0402, 0.711]     250
(0.711, 3.173]       250
dtype: int64

In [61]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.248, -0.0402], (-0.0402, 1.197], (-1.248, -0.0402], (-0.0402, 1.197], (-1.248, -0.0402], ..., (-1.248, -0.0402], (1.197, 3.173], (-0.0402, 1.197], (-3.026, -1.248], (-0.0402, 1.197]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.026, -1.248] < (-1.248, -0.0402] < (-0.0402, 1.197] < (1.197, 3.173]]

In [62]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026103    -0.017832     0.033099    -0.018348
std       0.983935     0.983043     0.987461     0.961771
min      -3.847735    -3.026342    -3.374487    -3.385350
25%      -0.607244    -0.672624    -0.663517    -0.674706
50%       0.040873    -0.004709     0.002973    -0.010991
75%       0.690427     0.626838     0.686635     0.616938
max       3.562601     3.389582     2.974200     3.148264

In [63]:
col = data[2]
col

0     -1.512355
1      1.116034
2      0.206250
3     -0.240840
4     -2.165685
         ...
995    0.557073
996    0.541197
997   -1.032915
998   -2.124601
999   -0.315220
Name: 2, Length: 1000, dtype: float64

In [64]:
col[col.abs() > 3]

81   -3.374487
Name: 2, dtype: float64

In [65]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
13   1.380213  3.389582 -0.060366 -0.516548
70  -0.838409  0.034811 -2.029039 -3.322469
81   0.555509 -1.033571 -3.374487 -0.086909
302 -0.447376 -0.312817  0.215184  3.148264
660 -1.045599  3.052069 -0.268636  0.303255
720  0.400639 -0.796251 -0.463459 -3.385350
733  3.562601 -1.953701 -0.480868  0.572162
834 -3.847735 -1.025752  1.068262  1.019993
881  0.626296 -3.026342 -0.367295  0.894626
989 -3.257673  0.140055  0.743524  0.017225

In [66]:
data[data.abs() > 3] = np.sign(data) * 3
data.head(3)

          0         1         2         3
0 -0.639482 -1.676507 -1.512355 -0.859154
1 -0.367986 -0.751655  1.116034  0.125284
2  0.724911  1.088716  0.206250  0.118622

In [67]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026646    -0.018247     0.033474    -0.017788
std       0.978253     0.981526     0.986237     0.958962
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.607244    -0.672624    -0.663517    -0.674706
50%       0.040873    -0.004709     0.002973    -0.010991
75%       0.690427     0.626838     0.686635     0.616938
max       3.000000     3.000000     2.974200     3.000000

In [68]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

In [69]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [70]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 4, 1, 2])

In [71]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [72]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [73]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [74]:
draws = choices.sample(n=10, replace=True)
draws

0    5
0    5
1    7
2   -1
0    5
2   -1
4    4
1    7
2   -1
2   -1
dtype: int64

In [75]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [76]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [77]:
dummies = pd.get_dummies(df["key"], prefix="key")
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [78]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [79]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [80]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [81]:
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [82]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [83]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [84]:
gen = movies.genres[0]
gen

"Animation|Children's|Comedy"

In [85]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [86]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [87]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [88]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [89]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [90]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [91]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [92]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [93]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [94]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [95]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [96]:
"::".join(pieces)

'a::b::guido'

In [97]:
"guido" in val

True

In [98]:
val.index(",")

1

In [99]:
val.find(":")

-1

In [100]:
val.index(":")

ValueError: substring not found

In [101]:
val.count(",")

2

In [102]:
val.replace(",", "::")

'a::b::  guido'

In [103]:
val.replace(",", "")

'ab  guido'

In [104]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [105]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [106]:
regex.findall(text)

['    ', '\t ', '  \t']

In [107]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [108]:
m = regex.search(text)
m

In [109]:
text[m.start():m.end()]

'dave@google.com'

In [110]:
print(regex.match(text))

None

In [111]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [112]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [113]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [114]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [115]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [116]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [117]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [118]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [119]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [120]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [121]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object